Revit 2027 API
BendingDetailAngularDimensionsMeasurementOptions Enumeration
 Describes the angular dimension measurement options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailAngularDimensionsMeasurementOptions
Public Enumeration BendingDetailAngularDimensionsMeasurementOptions
public enum class BendingDetailAngularDimensionsMeasurementOptions
type BendingDetailAngularDimensionsMeasurementOptions
Members
Member name | Value | Description
Inside | 0 |  Measure the angle inside the segments.
Outside | 1 |  Measure the angle outside of the segments.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace